-- Оконные функции.

--1. Создать таблицу и заполнить ее данными согласно скрипту.

--2. Вывести все товары и среднюю цену товара в каждой из категорий в отдельном столбце. Ответ округлить до целого.


--3. Вывести номер товара в порядке возрастания цены в каждой группе.


--4. Повторить предыдущий шаг, но товары с одинаковой ценой должны иметь одинаковый порядковый номер.


--5. Вывести для каждого товара разность его цены с предыдущим в одной товарной категории.


--6. Для каждого товара вывести наименьшую стоимость в данной товарной категории.

-- CTE

--1. Используя таблицу, созданную в предыдущем задании, вывести самый дорогой товар в каждой из категорий.


--2. Используя CTE вывести категории, имеющие более 3 товаров.

-- Рекурсия

--1. Написать запрос для вывода первых 10 членов геометрической прогресси с первым членом = 1 и множителем = 2.


--2. Написать запрос для вывода первых 50 чисел Фибоначи.


--3. Создать таблицу согласно скрипту.


--4. Вывести для менеджера с employee_id = 2 всех подчиненных с помощью рекурсии.